---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ProfileContainsNoLoops
source: html/2d75cea8-e008-c281-50aa-65e5d63cf212.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ProfileContainsNoLoops Property

Profile type '[Family Symbol]' contains no loops.

## Syntax (C#)
```csharp
public static FailureDefinitionId ProfileContainsNoLoops { get; }
```